#+STARTUP: indent contents
#+OPTIONS: num:nil toc:nil
** Part 2
Like with the other game of life style one, found a pattern. I'll show
it here:
#+BEGIN_SRC lisp :results output
  (let ((grid (text-to-grid *input*)))
    (iter (for i from 1 to 2000)
          (setf grid (next-minute grid))
          (when (> i (- 2000 57))
            (format t "~4,'0d: ~d~%" i (score-grid grid)))))
#+END_SRC

#+RESULTS:
#+begin_example
1944: 184032
1945: 184254
1946: 186880
1947: 191160
1948: 195000
1949: 198387
1950: 201798
1951: 201798
1952: 201465
1953: 199995
1954: 200178
1955: 197232
1956: 195460
1957: 191285
1958: 185004
1959: 181192
1960: 176484
1961: 178776
1962: 177232
1963: 179800
1964: 181853
1965: 185859
1966: 187850
1967: 190046
1968: 190740
1969: 186595
1970: 182560
1971: 184008
1972: 184032
1973: 184254
1974: 186880
1975: 191160
1976: 195000
1977: 198387
1978: 201798
1979: 201798
1980: 201465
1981: 199995
1982: 200178
1983: 197232
1984: 195460
1985: 191285
1986: 185004
1987: 181192
1988: 176484
1989: 178776
1990: 177232
1991: 179800
1992: 181853
1993: 185859
1994: 187850
1995: 190046
1996: 190740
1997: 186595
1998: 182560
1999: 184008
2000: 184032
#+end_example

It's a period of 28. So we can compute the score for the target minute
(1000000000). (1000000000 - 2000) mod 28 = 8. So it's whatever the
score is at 2008 (or 1980 or 19652 or 2036 or ...). I found the period
by printing out the first 2000 scores and searching backwards for matching
scores.

#+NAME: problem-b
#+BEGIN_SRC lisp :noweb yes :results silent
  (defun problem-b () (format t "Problem 18 B: ~a~%" (identity 201465)))
#+END_SRC
